Serviços Deprecados/Exemplos/AttributeRequestType.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<ns2:AttributeRequest xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ns4="http://www.cartaodecidadao.pt/ccc/commons/messages/Types" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://uri.etsi.org/01903/v1.3.2#" xmlns:ns7="http://www.cartaodecidadao.pt/ccc/commons/messages/SVG" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:ns2="http://www.cartaodecidadao.pt/ccc/sccc/messages/AttributeClientService" xmlns:ns3="http://www.cartaodecidadao.pt/ccc/commons/messages/Attribute" xmlns:ns1="http://www.cartaodecidadao.pt/ccc/tipos/SCAPSignature" xmlns:ns8="http://www.cartaodecidadao.pt/ccc/sccc/services/AttributeSupplierService" xmlns:ns9="http://www.cartaodecidadao.pt/ccc/sccc/messages/AttributeSupplierService">
			<ns2:ProcessId>d1ffa5c4-31e8-4678-b52d-babe60794328</ns2:ProcessId>
			<ns2:Citizen>
				<ns3:Name>TIAGO JOSÉ GONÇALVES BRÁS</ns3:Name>
				<ns3:NIC>138023522</ns3:NIC>
			</ns2:Citizen>
			<ns2:AttributeSuppliers>
				<ns2:AttributeSupplier>
					<ns3:Id>http://interop.gov.pt/SCAP/AMA</ns3:Id>
					<ns3:Name>Agência para a Modernização Administrativa</ns3:Name>
				</ns2:AttributeSupplier>
			</ns2:AttributeSuppliers>
			<ns2:AllEnterprises>false</ns2:AllEnterprises>
			<ns2:AppId>37a5c98a-4a7c-4da6-9be2-0605d2db0ac7</ns2:AppId>
			<ns2:AppName>Autenticacao.gov</ns2:AppName>
		</ns2:AttributeRequest>
	</soapenv:Body>
</soapenv:Envelope>